kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
1.2V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN1</name>
              <description>OFFSET_GAIN1[1:0]: gain / offset used in ADC single positive mode with Vinput range =

1.2V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN2</name>
              <description>OFFSET_GAIN2[1:0]: gain / offset used in ADC differential mode with Vinput range = 1.2V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN3</name>
              <description>OFFSET_GAIN3[1:0]: gain / offset used in ADC single negative mode with Vinput range =

2.4V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN4</name>
              <description>OFFSET_GAIN4[1:0]: gain / offset used in ADC single positive mode with Vinput range =

2.4V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN5</name>
              <description>OFFSET_GAIN5[1:0]: gain / offset used in ADC differential mode with Vinput range = 2.4V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN6</name>
              <description>OFFSET_GAIN6[1:0]: gain / offset used in ADC single negative mode with Vinput range =

3.6V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN7</name>
              <description>OFFSET_GAIN7[1:0]: gain / offset used in ADC single positive mode with Vinput range =

3.6V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN8</name>
              <description>OFFSET_GAIN8[1:0]: gain / offset used in ADC differential mode with Vinput range = 3.6V:

00: OFFSET1 and GAIN1 from COMP_1

01: OFFSET2 and GAIN2 from COMP_2

10: OFFSET3 and GAIN3 from COMP_3

11: OFFSET4 and GAIN4 from COMP_4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_TH</name>
          <displayName>WD_TH</displayName>
          <description>WD_TH register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFF0000</resetValue>
          <resetMask>0xFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WD_LT</name>
              <description>WD_LT[11:0]: analog watchdog low level threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WD_HT</name>
              <description>WD_HT[11:0]: analog watchdog high level threshold.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_CONF</name>
          <displayName>WD_CONF</displayName>
          <description>WD_CONF register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>AWD_CHX</name>
              <description>AWD_CHX[15:0]: analog watchdog channel selection to define which input channel(s) need

to be guarded by the watchdog.

Bit0: VINM[0] to ADC negative input

Bit1: VINM[1] to ADC negative input

Bit2: VINM[2] to ADC negative input

Bit3: VINM[3] to ADC negative input

Bit4: Not used

Bit5: VBAT to ADC negative input

Bit6: GND to ADC negative input

Bit7: VDDA to ADC negative input

Bit8: VINP[0] to ADC positive input

Bit9: VINP[1] to ADC positive input

Bit10: VINP[2] to ADC positive input

Bit11: VINP[3] to ADC positive input

