kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
Bit12: Not used

Bit13: TEMP to ADC positive input

Bit14: GND to ADC positive input

Bit15: VDDA to ADC positive input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_DATAOUT</name>
          <displayName>DS_DATAOUT</displayName>
          <description>DS_DATAOUT register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DS_DATA</name>
              <description>DS_DATA[15:0]: contain the converted data at the output of the Down Sampler.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS</name>
          <displayName>IRQ_STATUS</displayName>
          <description>IRQ_STATUS register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>EOC_IRQ</name>
              <description>EOC_IRQ (Used in test mode only): set when the ADC conversion is completed.

When read, provide the status of the interrupt:

0: ADC conversion is not completed

1: ADC conversion is completed

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EODS_IRQ</name>
              <description>EODS_IRQ: set when the Down Sampler conversion is completed.

When read, provide the status of the interrupt:

0: Down Sampler conversion is not completed

1: Down Sampler conversion is completed

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS_IRQ</name>
              <description>EOS_IRQ: set when a sequence of conversion is completed.

When read, provide the status of the interrupt:

0: sequence of conversion is not completed

1: sequence of conversion is completed

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWD_IRQ</name>
              <description>AWD_IRQ: set when an analog watchdog event occurs.

When read, provide the status of the interrupt:

0: no analog watchdog event occurred

1: analog watchdog event has occurred

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_DS_IRQ</name>
              <description>OVR_DS_IRQ: set to indicate a Down Sampler overrun (at least one data is lost)

When read, provide the status of the interrupt:

0: no overrun occurred

1: overrun occurred

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_ENABLE</name>
          <displayName>IRQ_ENABLE</displayName>
          <description>IRQ_ENABLE register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>EOC_IRQ</name>
              <description>EOC_IRQ (Used in test mode only): set when the ADC conversion is completed.

When read, provide the status of the interrupt:

0: ADC conversion is not completed

1: ADC conversion is completed

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EODS_IRQ</name>
              <description>EODS_IRQ: set when the Down Sampler conversion is completed.

When read, provide the status of the interrupt:

0: Down Sampler conversion is not completed

1: Down Sampler conversion is completed

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS_IRQ</name>
              <description>EOS_IRQ: set when a sequence of conversion is completed.

When read, provide the status of the interrupt:

0: sequence of conversion is not completed

1: sequence of conversion is completed

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWD_IRQ</name>
              <description>AWD_IRQ: set when an analog watchdog event occurs.

When read, provide the status of the interrupt:

0: no analog watchdog event occurred

1: analog watchdog event has occurred

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_DS_IRQ</name>
              <description>OVR_DS_IRQ: set to indicate a Down Sampler overrun (at least one data is lost)

When read, provide the status of the interrupt:

0: no overrun occurred

