kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
1: overrun occurred

Writing this bit clears the status of the interrupt:

0: no effect

1: clear the interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CONF</name>
          <displayName>TIMER_CONF</displayName>
          <description>TIMER_CONF register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x28</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ADC_LDO_DELAY</name>
              <description>ADC_LDO_DELAY[7:0]: define the duration of a waiting time to be inserted between the

ADC_LDO enable and the ADC ON to let time to the LDO to stabilize before starting a

conversion.

The time unit is 4 us.

Maximum delay is 1.02 ms (255 x 4 us).

Default value is 40 = 160 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CONF</name>
          <displayName>TEST_CONF</displayName>
          <description>TEST_CONF register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>ADC_SWITCH_EN</name>
              <description>ADC_SWITCH_EN[15:0]: enable individually each connection of the switching matrix at the

ADC input.

For each bit:

0: switch X is ON

1: switch X is OFF

Bit mapping (corresponding to AUXADC_INSEL_1V2[15:0]):

Bit 0: VINM[0] to ADC negative input

Bit 1: VINM[1] to ADC negative input

Bit 2: VINM[2] to ADC negative input

Bit 3: VINM[3] to ADC negative input

Bit4: GND to ADC negative input

Bit5: VBAT to ADC negative input

Bit6: GND to ADC negative input

Bit7: VDDA to ADC negative input

Bit8: VINP[0] to ADC positive input

Bit9: VINP[1] to ADC positive input

Bit10: VINP[2] to ADC positive input

Bit11: VINP[3] to ADC positive input

Bit12: VBAT to ADC positive input

Bit13: TEMP to ADC positive input

Bit14: GND to ADC positive input

Bit15: VDDA to ADC positive input.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_VIN_TYPE</name>
              <description>SEL_VIN_TYPE[1:0]: operation mode of the selected VIN

00: ADC single negative input

01: ADC single positive input

10: ADC differential input mode

11: reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_RUN</name>
              <description>ADC_RUN: Start/stop ADC conversion.

0: stop the ADC conversion,

1: starts the ADC conversion.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ENABLE</name>
              <description>ADC_ENABLE:

0: disable the ADC (power OFF)

1: enable the ADC (power ON)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_ADC_ENABLE</name>
              <description>LDO_ADC_ENABLE:

0: disable the ADC LDO

1: enable the ADC LDO</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTB_CONF</name>
          <displayName>DTB_CONF</displayName>
          <description>DTB_CONF register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1000A</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_DBG_CONF</name>
              <description>ADC_DBG_CONF[3:0]: use for debug purpose.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DTB_CONF</name>
              <description>ADC_DTB_CONF[1:0]: configure the DTB output.

00: DTB bus is all 0

01: output the ADC_BUSY, ADC_EOC, offset compensation data[11:0] on the ADC_DTB

10: output the DS information on the ADC_DTB

11: select states of the FSM and enable ADC serial output

Note: detailed DTB configurations are available in the Table 38 in IUM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSM_STATE</name>
              <description>FSM_STATE[7:0]: show the state of the state machine.

Bit 0: IDLE

Bit 1: ADC_LDO setup phase

Bit 2: ADC setup phase

Bit 3: PGA BIAS setup phase

Bit 4: ADC_START_CONV resynchronization

Bit 5: Analog Audio mode or Full mode

Bit 6: ADC mode or occasional mode

Bit 7: sequence mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_CUR_STATE</name>
              <description>FSM_CUR_STATE[2:0]: show the last executed state by the state machine.

000: IDLE mode

001: ADC_LDO setup phase

010: ADC setup phase

011: PGA BIAS setup phase

100: ADC_START_CONV resynchronization

101: Analog Audio mode or Full mode

110: ADC mode or occasional mode

111: sequence mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
