kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOB</name>
      <groupName>GPIOB</groupName>
      <baseAddress>0x48100000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIOB</name>
        <description>GPIOB interrupt</description>
        <value>16</value>
      </interrupt>
      <registers>
        <register>
          <name>MODER</name>
          <displayName>MODER</displayName>
          <description>MODER register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE0</name>
              <description>MODE0[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>MODE1[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>MODE2[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>MODE3[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE4</name>
              <description>MODE4[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE5</name>
              <description>MODE5[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE6</name>
              <description>MODE6[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE7</name>
              <description>MODE7[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE12</name>
              <description>MODE12[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE13</name>
              <description>MODE13[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE14</name>
              <description>MODE14[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE15</name>
              <description>MODE15[1:0]Port B configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <displayName>OTYPER</displayName>
          <description>OTYPER register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OT0</name>
              <description>OT0: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT1</name>
              <description>OT1: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT2</name>
              <description>OT2: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT3</name>
              <description>OT3: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT4</name>
              <description>OT4: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT5</name>
              <description>OT5: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT6</name>
              <description>OT6: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT7</name>
              <description>OT7: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT12</name>
              <description>OT12: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT13</name>
              <description>OT13: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT14</name>
              <description>OT14: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT15</name>
              <description>OT15: Port B configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <displayName>OSPEEDR</displayName>
          <description>OSPEEDR register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>OSPEED0[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>OSPEED1[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>OSPEED2[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>OSPEED3[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>OSPEED4[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>OSPEED5[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>OSPEED6[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>OSPEED7[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED12</name>
              <description>OSPEED12[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED13</name>
              <description>OSPEED13[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED14</name>
              <description>OSPEED14[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED15</name>
              <description>OSPEED15[1:0]: Port B configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <displayName>PUPDR</displayName>
          <description>PUPDR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55005555</resetValue>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>PUPD0: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD1</name>
              <description>PUPD1: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down 
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD2</name>
              <description>PUPD2: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD3</name>
              <description>PUPD3: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD4</name>
              <description>PUPD4: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD5</name>
              <description>PUPD5: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD6</name>
              <description>PUPD6: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down 
-01: Pull-up 
-10: Pull-down 
-11: Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD7</name>
              <description>PUPD7: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD12</name>
              <description>PUPD12: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD13</name>
              <description>PUPD13: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD14</name>
              <description>PUPD14: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD15</name>
              <description>PUPD15: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
