kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>IDR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID0</name>
              <description>ID0:   Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>ID1:   Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>ID2:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>ID3:   Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID4</name>
              <description>ID4:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID5</name>
              <description>ID5:   Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID6</name>
              <description>ID6:   Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID7</name>
              <description>ID7:   Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID12</name>
              <description>ID12:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID13</name>
              <description>ID13:   Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID14</name>
              <description>ID14:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID15</name>
              <description>ID15:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>ODR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OD0</name>
              <description>OD0:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD1</name>
              <description>OD1:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD2</name>
              <description>OD2:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD3</name>
              <description>OD3:   Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD4</name>
              <description>OD4:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD5</name>
              <description>OD5:   Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD6</name>
              <description>OD6:   Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD7</name>
              <description>OD7:   Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD12</name>
              <description>OD12: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD13</name>
              <description>OD13: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD14</name>
              <description>OD14: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD15</name>
              <description>OD15: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>BSRR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BS0</name>
              <description>BS0: Port B set bit 0 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS1</name>
              <description>BS1: Port B set bit 1 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS2</name>
              <description>BS2: Port B set bit 2 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS3</name>
              <description>BS3: Port B set bit 3 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS4</name>
              <description>BS4: Port B set bit 4 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS5</name>
              <description>BS5: Port B set bit 5 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS6</name>
              <description>BS6: Port B set bit 6 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS7</name>
              <description>BS7: Port B set bit 7 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS12</name>
              <description>BS12: Port B set bit 12 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS13</name>
              <description>BS13: Port B set bit 13 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS14</name>
              <description>BS14: Port B set bit 14
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS15</name>
              <description>BS15: Port B set bit 15
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Sets the corresponding ODx bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR0</name>
              <description>BR0: Port B reset bit 0 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR1</name>
              <description>BR1: Port B reset bit 1 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR2</name>
              <description>BR2: Port B reset bit 2 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR3</name>
              <description>BR3: Port B reset bit 3 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR4</name>
              <description>BR4: Port B reset bit 4 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR5</name>
              <description>BR5: Port B reset bit 5 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR6</name>
              <description>BR6: Port B reset bit 6 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR7</name>
              <description>BR7: Port B reset bit 7 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR12</name>
              <description>BR12: Port B reset bit 12 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR13</name>
              <description>BR13: Port B reset bit 13 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR14</name>
              <description>BR14: Port B reset bit 14 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR15</name>
              <description>BR15: Port B reset bit 15 These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
