kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
        <register>
          <name>ENGTRIM</name>
          <displayName>ENGTRIM</displayName>
          <description>ENGTRIM register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TRIMRFDREGEN</name>
              <description>TRIMRFDREGEN: RFD_REG_TRIM software overload enable.
0: Hardware trimming value from TRIMR.RFD_REG_TRIM bit field is applied.
1: Software trimming value from ENGTRIM.RFD_REG_TRIM bit field is applied</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFD_REG_TRIM</name>
              <description>RFD_REG_TRIM[3:0]: RF LDO trimming chosen by the software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMMREN</name>
              <description>TRIMMREN: TRIM_MR software overload enable.
0: Hardware trimming value from TRIMR.TRIM_MR bit field is applied.
1: Software trimming value from ENGTRIM.TRIM_MR bit field is applied</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_MR</name>
              <description>TRIM_MR[3:0]: Main regulator voltage trimming chosen by the software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSTRIMEN</name>
              <description>SMPSTRIMEN: SMPS_TRIM software overload enable.
0: Hardware trimming value from TRIMR.SMPS_TRIM bit field is applied.
1: Trimming value from ENGTRIM.SMPS_TRIM bit field is applied</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_TRIM</name>
              <description>SMPS_TRIM[2:0]: SMPS output voltage trimming chosen by the software.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG1</name>
          <displayName>DBG1</displayName>
          <description>DBG1 register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x202</resetValue>
          <fields>
            <field>
              <name>SMPS_FSM_STATE</name>
              <description>These bits are set and cleared by the SMPS FSM.They show the sequencer  executed states.
2: SMPS RUN
3: STOP
4: NOSMPS
5: PRECHARGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description> STARTUP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description> SMPS REQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_FSM_STATE</name>
              <description>These bits are set and cleared by the FLASH FSM.They show the sequencer  executed states.
2: READY
3: SWITCH OFF
4: POWER DOWN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description> POR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description> POWER UP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG2</name>
          <displayName>DBG2</displayName>
          <description>DBG2 register</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x201</resetValue>
          <fields>
            <field>
              <name>PMU_FSM_STATE</name>
              <description>These bits are set and cleared by the PMU FSM.They show the sequencer  executed states.
2: DS ENTRY
3: WAIT1
4: WAIT2
5: WAIT
6: WAIT3
7: WAIT4
8: ISOLATION
9: DEEPSTOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description> POR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description> RUN</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description> SHUTDOWN</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description> DEEPSTOP EXIT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_FSM_STATE</name>
              <description>These bits are set and cleared by the RAM FSM.They show the sequencer  executed states.
2: READY
3: OFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description> POR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description> POWER UP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
