kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
        <register>
          <name>IO_IBER</name>
          <displayName>IO_IBER</displayName>
          <description>IO_IBER register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>PA0_IBE</name>
              <description>PA0_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_IBE</name>
              <description>PA1_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_IBE</name>
              <description>PA2_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_IBE</name>
              <description>PA3_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_IBE</name>
              <description>PA8_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_IBE</name>
              <description>PA9_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_IBE</name>
              <description>PA10_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_IBE</name>
              <description>PA11_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_IBE</name>
              <description>PB0_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_IBE</name>
              <description>PB1_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_IBE</name>
              <description>PB2_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_IBE</name>
              <description>PB3_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_IBE</name>
              <description>PB4_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_IBE</name>
              <description>PB5_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_IBE</name>
              <description>PB6_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_IBE</name>
              <description>PB7_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_IBE</name>
              <description>PB12_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_IBE</name>
              <description>PB13_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_IBE</name>
              <description>PB14_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_IBE</name>
              <description>PB15_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_IEVR</name>
          <displayName>IO_IEVR</displayName>
          <description>IO_IEVR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA0_IEV</name>
              <description>PA0_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_IEV</name>
              <description>PA1_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_IEV</name>
              <description>PA2_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_IEV</name>
              <description>PA3_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_IEV</name>
              <description>PA8_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_IEV</name>
              <description>PA9_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_IEV</name>
              <description>PA10_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_IEV</name>
              <description>PA11_IEV : Interrupt polarity event for Port A I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_IEV</name>
              <description>PB0_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_IEV</name>
              <description>PB1_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_IEV</name>
              <description>PB2_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_IEV</name>
              <description>PB3_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_IEV</name>
              <description>PB4_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_IEV</name>
              <description>PB5_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_IEV</name>
              <description>PB6_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_IEV</name>
              <description>PB7_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_IEV</name>
              <description>PB12_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_IEV</name>
              <description>PB13_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_IEV</name>
              <description>PB14_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_IEV</name>
              <description>PB15_IEV : Interrupt polarity event for Port B I/Os.
0: falling edge / low level.
1: rising edge / high level.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
