kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
        <register>
          <name>INTERRUPT1ENABLEREG</name>
          <displayName>INTERRUPT1ENABLEREG</displayName>
          <description>INTERRUPT1ENABLEREG register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDPOINTERROR</name>
              <description>Address Pointer Error  enable interruption</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOVERFLOWERROR</name>
              <description>Rx Overflow Error enable interruption</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQDONE</name>
              <description>Sequencer end of task enable interruption</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXERROR_0</name>
              <description>Transmission error 0 enable interruption</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXERROR_1</name>
              <description>Transmission error 1 enable interruption</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXERROR_2</name>
              <description>Transmission error 2 enable interruption</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXERROR_3</name>
              <description>Transmission error 3 enable interruption</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXERROR_4</name>
              <description>Transmission error 4 enable interruption</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENCERROR</name>
              <description>Encryption error on receive enable interruption</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALLTABLEREADYERROR</name>
              <description>All RAM Table not ready enable interruption</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXDATAREADYERROR</name>
              <description>Transmit data pack not ready enable interruption</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NOACTIVELERROR</name>
              <description>active bit error enable interruption</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCVLENGTHERROR</name>
              <description>Receive length error enable interruption</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEMATIMEOUTERROR</name>
              <description>Semaphore timeout error enable interruption</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRXSKIP</name>
              <description>Transmission/Reception skip enable interruption</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTIVE2ERROR</name>
              <description>Active2 Radio state error enable interruption</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CONFIGERROR</name>
              <description>Data pointer configuration error enable interruption</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXOK</name>
              <description>Previous transmitted packet received OK enable interruption</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>Receive/Transmit done interruption</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCVTIMEOUT</name>
              <description>Receive timeout enable interruption (no preamble found)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCVNOMD</name>
              <description>Received MD bit embedded in the PDU data packet header was zero enable interruption</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCVCMD</name>
              <description>Received command enable interruption</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMECAPTURETRIG</name>
              <description>TimerCaptureReg time capture enable interruption</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCVCRCERR</name>
              <description>Receive data fail enable interruption</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCVOK</name>
              <description>Receive data OK enable interruption</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT1LATENCYREG</name>
          <displayName>INTERRUPT1LATENCYREG</displayName>
          <description>INTERRUPT1LATENCYREG register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERRUPT1LATENCY</name>
              <description>relative time counter started on irq_BLE_int1 (BLE_TXRX) occurrence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESKEY0REG</name>
          <displayName>MANAESKEY0REG</displayName>
          <description>MANAESKEY0REG register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MANAESKEY_31_0</name>
              <description>Manual mode AES key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESKEY1REG</name>
          <displayName>MANAESKEY1REG</displayName>
          <description>MANAESKEY1REG register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MANAESKEY_63_32</name>
              <description>Manual mode AES key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESKEY2REG</name>
          <displayName>MANAESKEY2REG</displayName>
          <description>MANAESKEY2REG register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MANAESKEY_95_64</name>
              <description>Manual mode AES key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESKEY3REG</name>
          <displayName>MANAESKEY3REG</displayName>
          <description>MANAESKEY3REG register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MANAESKEY_127_96</name>
              <description>Manual mode AES key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCLEARTEXT0REG</name>
          <displayName>MANAESCLEARTEXT0REG</displayName>
          <description>MANAESCLEARTEXT0REG register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual Aes Clear Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCLEARTEXT1REG</name>
          <displayName>MANAESCLEARTEXT1REG</displayName>
          <description>MANAESCLEARTEXT1REG register</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual Aes Clear Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCLEARTEXT2REG</name>
          <displayName>MANAESCLEARTEXT2REG</displayName>
          <description>MANAESCLEARTEXT2REG register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual Aes Clear Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCLEARTEXT3REG</name>
          <displayName>MANAESCLEARTEXT3REG</displayName>
          <description>MANAESCLEARTEXT3REG register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual Aes Clear Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCIPHERTEXT0REG</name>
          <displayName>MANAESCIPHERTEXT0REG</displayName>
          <description>MANAESCIPHERTEXT0REG register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual AES Cipher Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCIPHERTEXT1REG</name>
          <displayName>MANAESCIPHERTEXT1REG</displayName>
          <description>MANAESCIPHERTEXT1REG register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual AES Cipher Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCIPHERTEXT2REG</name>
          <displayName>MANAESCIPHERTEXT2REG</displayName>
          <description>MANAESCIPHERTEXT2REG register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual AES Cipher Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCIPHERTEXT3REG</name>
          <displayName>MANAESCIPHERTEXT3REG</displayName>
          <description>MANAESCIPHERTEXT3REG register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>Manual AES Cipher Text</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESCMDREG</name>
          <displayName>MANAESCMDREG</displayName>
          <description>MANAESCMDREG register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>START</name>
              <description>AES Manual encryption Start command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTENA</name>
              <description>AES Manual encryption interrupt enable on Interrupt2Reg</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MANAESSTATREG</name>
          <displayName>MANAESSTATREG</displayName>
          <description>MANAESSTATREG register</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>AES manual encryption busy status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESLEPRIVPOINTERREG</name>
          <displayName>AESLEPRIVPOINTERREG</displayName>
          <description>AESLEPRIVPOINTERREG register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POINTER</name>
              <description>AES Le privacy pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESLEPRIVHASHREG</name>
          <displayName>AESLEPRIVHASHREG</displayName>
          <description>AESLEPRIVHASHREG register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH</name>
              <description>AES Le privacy Reference Hash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESLEPRIVPRANDREG</name>
          <displayName>AESLEPRIVPRANDREG</displayName>
          <description>AESLEPRIVPRANDREG register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRAND</name>
              <description>AES Le privacy Prand</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESLEPRIVCMDREG</name>
          <displayName>AESLEPRIVCMDREG</displayName>
          <description>AESLEPRIVCMDREG register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>START</name>
              <description>AES Le privacy Start command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTENA</name>
              <description>AES Le privacy interrupt enable on Interrupt2Reg</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NBKEYS</name>
              <description>AES Le privacy number of keys pointed by AesLePrivPointerReg  (points to the resolution key list.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESLEPRIVSTATREG</name>
          <displayName>AESLEPRIVSTATREG</displayName>
          <description>AESLEPRIVSTATREG register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>AES Le privacy busy status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEYFND</name>
              <description>AES Le privacy key finding status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEYFNDINDEX</name>
              <description>AES Le privacy index of the key found in the resolution key list.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
