kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
        <register>
          <name>CBIAS1_ANA_ENG</name>
          <displayName>CBIAS1_ANA_ENG</displayName>
          <description>CBIAS1_ANA_ENG register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CBIAS0_TRIM_TST_SEL</name>
              <description>When set, RFD_CBIAS_(IPTAT/IBIAS)_TRIM are used instead of HW trimmings</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL0_DIG_OUT</name>
          <displayName>SYNTHCAL0_DIG_OUT</displayName>
          <description>SYNTHCAL0_DIG_OUT register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VCO_CALAMP_OUT_6_0</name>
              <description>VCO CALAMP value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL1_DIG_OUT</name>
          <displayName>SYNTHCAL1_DIG_OUT</displayName>
          <description>SYNTHCAL1_DIG_OUT register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>VCO_CALAMP_OUT_10_7</name>
              <description>VCO CALAMP value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL2_DIG_OUT</name>
          <displayName>SYNTHCAL2_DIG_OUT</displayName>
          <description>SYNTHCAL2_DIG_OUT register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>VCO_CALFREQ_OUT</name>
              <description>VCO CALFREQ value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL3_DIG_OUT</name>
          <displayName>SYNTHCAL3_DIG_OUT</displayName>
          <description>SYNTHCAL3_DIG_OUT register</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNTHCAL_DEBUG_BUS</name>
              <description>Calibration debug bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL4_DIG_OUT</name>
          <displayName>SYNTHCAL4_DIG_OUT</displayName>
          <description>SYNTHCAL4_DIG_OUT register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>MOD_REF_DAC_WORD_OUT</name>
              <description>Calibration word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL5_DIG_OUT</name>
          <displayName>SYNTHCAL5_DIG_OUT</displayName>
          <description>SYNTHCAL5_DIG_OUT register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>CBP_CALIB_WORD</name>
              <description>CBP Calibration word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STATUS_DIG_OUT</name>
          <displayName>FSM_STATUS_DIG_OUT</displayName>
          <description>FSM_STATUS_DIG_OUT register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>RF FSM state:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNTH_CAL_ERROR</name>
              <description>PLL calibration error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI0_DIG_OUT</name>
          <displayName>RSSI0_DIG_OUT</displayName>
          <description>RSSI0_DIG_OUT register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>RSSI_MEAS_OUT_7_0</name>
              <description>Measure of the received signal strength.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI1_DIG_OUT</name>
          <displayName>RSSI1_DIG_OUT</displayName>
          <description>RSSI1_DIG_OUT register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>RSSI_MEAS_OUT_15_8</name>
              <description>Measure of the received signal strength</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_DIG_OUT</name>
          <displayName>AGC_DIG_OUT</displayName>
          <description>AGC_DIG_OUT register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AGC_ATT_OUT</name>
              <description>AGC attenuation value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_DIG_OUT</name>
          <displayName>DEMOD_DIG_OUT</displayName>
          <description>DEMOD_DIG_OUT register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CI_FIELD</name>
              <description>CI field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AAC_FOUND</name>
              <description>aac_found</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PD_FOUND</name>
              <description>pd_found</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_END</name>
              <description>rx_end</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC2_ANA_TST</name>
          <displayName>AGC2_ANA_TST</displayName>
          <description>AGC2_ANA_TST register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AGC2_ANA_TST_SEL</name>
              <description>Selection:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_ANTENNAE_USR_TRIM</name>
              <description>the AGC antenna trimming value ( when AGC2_ANA_TST_SEL = 1)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC0_DIG_ENG</name>
          <displayName>AGC0_DIG_ENG</displayName>
          <description>AGC0_DIG_ENG register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000004A</resetValue>
          <fields>
            <field>
              <name>AGC_THR_HIGH</name>
              <description>High AGC threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_ENABLE</name>
              <description>Enable AGC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC1_DIG_ENG</name>
          <displayName>AGC1_DIG_ENG</displayName>
          <description>AGC1_DIG_ENG register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000084</resetValue>
          <fields>
            <field>
              <name>AGC_THR_LOW_6</name>
              <description>Low threshold for 6dB steps</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_AUTOLOCK</name>
              <description>AGC locks when level is steady between high threshold and lock threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_LOCK_SYNC</name>
              <description>AGC locks when Access Address is detected (recommended)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC10_DIG_ENG</name>
          <displayName>AGC10_DIG_ENG</displayName>
          <description>AGC10_DIG_ENG register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATT_IF_0</name>
              <description>Attenuation at IF Level for the AGC step 0:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_0</name>
              <description>Attenuation at LNA Level for the AGC step 0:
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_0</name>
              <description>Attenuation at Antenna Level for the AGC step 0:
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC11_DIG_ENG</name>
          <displayName>AGC11_DIG_ENG</displayName>
          <description>AGC11_DIG_ENG register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>ATT_IF_1</name>
              <description>Attenuation at IF Level for the AGC step 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_1</name>
              <description>Attenuation at LNA Level for the AGC step 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_1</name>
              <description>Attenuation at Antenna Level for the AGC step 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC12_DIG_ENG</name>
          <displayName>AGC12_DIG_ENG</displayName>
          <description>AGC12_DIG_ENG register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000020</resetValue>
          <fields>
            <field>
              <name>ATT_IF_2</name>
              <description>Attenuation at IF Level for the AGC step 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_2</name>
              <description>Attenuation at LNA Level for the AGC step 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_2</name>
              <description>Attenuation at Antenna Level for the AGC step 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC13_DIG_ENG</name>
          <displayName>AGC13_DIG_ENG</displayName>
          <description>AGC13_DIG_ENG register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>ATT_IF_3</name>
              <description>Attenuation at IF Level for the AGC step 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_3</name>
              <description>Attenuation at LNA Level for the AGC step 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_3</name>
              <description>Attenuation at Antenna Level for the AGC step 3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC14_DIG_ENG</name>
          <displayName>AGC14_DIG_ENG</displayName>
          <description>AGC14_DIG_ENG register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000038</resetValue>
          <fields>
            <field>
              <name>ATT_IF_4</name>
              <description>Attenuation at IF Level for the AGC step 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_4</name>
              <description>Attenuation at LNA Level for the AGC step 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_4</name>
              <description>Attenuation at Antenna Level for the AGC step 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC15_DIG_ENG</name>
          <displayName>AGC15_DIG_ENG</displayName>
          <description>AGC15_DIG_ENG register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000039</resetValue>
          <fields>
            <field>
              <name>ATT_IF_5</name>
              <description>Attenuation at IF Level for the AGC step 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_5</name>
              <description>Attenuation at LNA Level for the AGC step 5</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_5</name>
              <description>Attenuation at Antenna Level for the AGC step 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC16_DIG_ENG</name>
          <displayName>AGC16_DIG_ENG</displayName>
          <description>AGC16_DIG_ENG register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003A</resetValue>
          <fields>
            <field>
              <name>ATT_IF_6</name>
              <description>Attenuation at IF Level for the AGC step 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_6</name>
              <description>Attenuation at LNA Level for the AGC step 6</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_6</name>
              <description>Attenuation at Antenna Level for the AGC step 6</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC17_DIG_ENG</name>
          <displayName>AGC17_DIG_ENG</displayName>
          <description>AGC17_DIG_ENG register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003B</resetValue>
          <fields>
            <field>
              <name>ATT_IF_7</name>
              <description>Attenuation at IF Level for the AGC step 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_7</name>
              <description>Attenuation at LNA Level for the AGC step 7</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_7</name>
              <description>Attenuation at Antenna Level for the AGC step 7</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC18_DIG_ENG</name>
          <displayName>AGC18_DIG_ENG</displayName>
          <description>AGC18_DIG_ENG register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003C</resetValue>
          <fields>
            <field>
              <name>ATT_IF_8</name>
              <description>Attenuation at IF Level for the AGC step 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_8</name>
              <description>Attenuation at LNA Level for the AGC step 8</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_8</name>
              <description>Attenuation at Antenna Level for the AGC step 8</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
