kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/STM32WB05N.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WAKEUP_REG</name>
      <groupName>WAKEUP_REG_BLOCK</groupName>
      <baseAddress>0x60001800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RADIO_CPU_WKUP</name>
        <description>RADIO CPU Wakeup interrupt</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>RADIO_TXRX_WKUP</name>
        <description>RADIO Wakeup interrupt</description>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>WAKEUP_OFFSET</name>
          <displayName>WAKEUP_OFFSET</displayName>
          <description>WAKEUP_OFFSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_OFFSET</name>
              <description>delay of anticipation of the Soc device to settle power and clock
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ABSOLUTE_TIME</name>
          <displayName>ABSOLUTE_TIME</displayName>
          <description>ABSOLUTE_TIME register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ABSOLUTE_TIME</name>
              <description>absolute time
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MINIMUM_PERIOD_LENGTH</name>
          <displayName>MINIMUM_PERIOD_LENGTH</displayName>
          <description>MINIMUM_PERIOD_LENGTH register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LENGTH</name>
              <description>minimum period length computed by Time Interpolator</description>
              <bitOffset>4</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AVERAGE_PERIOD_LENGTH</name>
          <displayName>AVERAGE_PERIOD_LENGTH</displayName>
          <description>AVERAGE_PERIOD_LENGTH register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LENGTH_FRACT</name>
              <description>additional information/precision on slow clock frequency.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LENGTH_INT</name>
              <description>average period length computed by Time Interpolator.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVERAGE_COUNT</name>
              <description>Number of slow clock cycles.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXIMUM_PERIOD_LENGTH</name>
          <displayName>MAXIMUM_PERIOD_LENGTH</displayName>
          <description>MAXIMUM_PERIOD_LENGTH register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LENGTH</name>
              <description>maximum period length computed by Time Interpolator</description>
              <bitOffset>4</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATISTICS_RESTART</name>
          <displayName>STATISTICS_RESTART</displayName>
          <description>STATISTICS_RESTART register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLR_MIN_MAX</name>
              <description>Write '1' to clear the minimum and maximum registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR_AVR</name>
              <description>Write '1' to clear the AVERAGE_PERIOD_LENGTH register value.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLUE_WAKEUP_TIME</name>
          <displayName>BLUE_WAKEUP_TIME</displayName>
          <description>BLUE_WAKEUP_TIME register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_TIME</name>
              <description>programmed wakeup time for the IP_BLE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLUE_SLEEP_REQUEST_MODE</name>
          <displayName>BLUE_SLEEP_REQUEST_MODE</displayName>
          <description>BLUE_SLEEP_REQUEST_MODE register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>IP_BLE sleeping mode enable:
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_WAKEUP_EN</name>
              <description>IP_BLE wakeup enable:
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_SLEEPING</name>
              <description>IP_BLE sleeping control:
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_WAKEUP_TIME</name>
          <displayName>CM0_WAKEUP_TIME</displayName>
          <description>CM0_WAKEUP_TIME register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_TIME</name>
              <description>programmed wakeup time for CPU.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_SLEEP_REQUEST_MODE</name>
          <displayName>CM0_SLEEP_REQUEST_MODE</displayName>
          <description>CM0_SLEEP_REQUEST_MODE register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x80000007</resetValue>
          <fields>
            <field>
              <name>CPU_WAKEUP_EN</name>
              <description>CPU wakeup enable:
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_SLEEPING</name>
              <description>CPU sleeping control:
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_BLE_IRQ_ENABLE</name>
          <displayName>WAKEUP_BLE_IRQ_ENABLE</displayName>
          <description>WAKEUP_BLE_IRQ_ENABLE register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_IT</name>
              <description>IP_BLE wakeup interrupt enable:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_BLE_IRQ_STATUS</name>
          <displayName>WAKEUP_BLE_IRQ_STATUS</displayName>
          <description>WAKEUP_BLE_IRQ_STATUS register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_IT</name>
              <description>On read, returns the IP_BLE wakeup interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_CM0_IRQ_ENABLE</name>
          <displayName>WAKEUP_CM0_IRQ_ENABLE</displayName>
          <description>WAKEUP_CM0_IRQ_ENABLE register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_IT</name>
              <description>CPU wakeup interrupt enable:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_CM0_IRQ_STATUS</name>
          <displayName>WAKEUP_CM0_IRQ_STATUS</displayName>
          <description>WAKEUP_CM0_IRQ_STATUS register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_IT</name>
              <description>On read, returns the CPU wakeup interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
